app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("name", "body", "created_at", "updated_at") VALUES ('manish', 'manish', '2024-11-15 10:45:43.238289', '2024-11-15 10:45:43.238289') RETURNING "id"

  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = 9 LIMIT 1
UPDATE "articles" SET "name" = 'manish', "updated_at" = '2024-11-15 12:52:56.611909' WHERE "articles"."id" = 9